SET @start_time = '2016-01-01 00:00:00';
SET @value = 60 * 60 * 24 * 365;
SET @A = 'ACCEPTED';
SET @D = 'DECLINED';
SET @N = 'NEW';
SET @MODER_ID = 1;

INSERT INTO posts (activity_status, moderation_status, moderator_id, user_id, time, title, text, view_count)
VALUES ('ACTIVE', @A, NULL, 1, '2016-01-01 00:00:00', 'Шинра Тенсей', 'Самый лучший текст', 10),
       ('ACTIVE', @N, NULL, 2, '2016-01-01 12:00:00', 'Супер шок!', 'Меня зовут Герман Картер!', 0),
       ('INACTIVE', @N, NULL, 3, '2016-02-02 00:00:00', 'Шиндоус', 'Время переустанавливать шиндооус!', 0),
       ('ACTIVE', @A, @MODER_ID, 3, '2016-03-03 00:00:00', 'Чипирование', 'Чип Чип Чип Чип Чип и Дейл к вам спешат...', 1),
       ('ACTIVE', @D, @MODER_ID, 3, '2016-04-04 13:00:00', 'Вышка 5G', 'Известна вам как Выжигатель Мозгов', 0),
       ('ACTIVE', @D, @MODER_ID, 3, '2016-04-04 14:00:00', 'Вышка 5G, Версия 2', 'Продолжение истории про вышки!', 0),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-05-05 12:00:00', 'Тема_1', 'Текст_1', 9),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-05-06 12:00:00', 'Тема_2', 'Текст_2', 8),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-05-07 12:00:00', 'Тема_3', 'Текст_3', 7),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-06-06 12:00:00', 'Тема_4', 'Текст_4', 6),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-07-07 12:00:00', 'Тема_5', 'Текст_5', 5),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-08-08 12:00:00', 'Тема_6', 'Текст_6', 4),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-09-09 12:00:00', 'Тема_7', 'Текст_7', 3),
       ('ACTIVE', @A, @MODER_ID, 4, '2016-09-09 14:14:14', 'Тема_8', 'Текст_8', 2),
       ('ACTIVE', @A, @MODER_ID, 4, '2017-12-12 12:00:00', 'Тема_9', 'Текст_9', 1),
       ('ACTIVE', @A, NULL, 4, '2018-01-01 12:12:12', 'Тема_10', 'Текст_10', 0),
       ('ACTIVE', @A, NULL, 4, '2018-12-31 23:59:50', 'Тема_11', 'Текст_11', 0),
       ('ACTIVE', @A, NULL, 4, '2021-01-01 12:00:00', 'Современный заголовок', 'Современный текст', 0)